{
  "app_name": "Portfolio",

  "website": "website",

  "send": "Send",
  "sending": "Sending",
  "sent": "Sent",
  "failed": "Failed",

  "about_me": "about me",
  "projects": "projects",
  "contact": "contact",
  "view_details": "View details",

  "favorite_techs": "Favorite technologies",
  "published": "published",
  "library": "library",

  "name": "Name",
  "enter_name": "Enter your name",
  "email": "Email",
  "enter_email": "Enter your email",
  "invalid_email": "Invalid email",
  "message": "Message",
  "enter_message": "Enter your message",
  "required": "This field is required",

  "zappr_description": "Zappr is a social network available on Android and iOS, which I co-founded with a friend and developed alone.\n\nZappr was initially a pure Android app written in Kotlin (and some Java) but later on I re-programmed it from scratch into what it is now: a Flutter app. It uses Firebase for authentication, notifications and deep links.\n\nI chose Python/Django for the backend, because I had previous knowledge of it and knew it could power an api. Instead of using Celery to manage my workers, I went with DjangoQ for an easy integration with Django. The app is deployed with uWSGI behind an Nginx proxy in a Kubernetes environment. The integrated chat is powered by Django Channels (websockets), deployed with Daphne.",
  "chat_ui_kit_description": "Chat Ui Kit is a published Flutter library that I wrote, because at the time no proper solution existed. The only package available was lacking core chat features such as support for groups, list conversations, typing events and more...\n\nSince I needed those features in Zappr, I decided to write this library which provides a complete tool set for developing a Flutter chat.",
  "portfolio_description": "There is currently no backend for this portfolio but I might add some feature that would require one in the future!\n\nUntil then, you can check out the code if you’re curious about some animations 😊.",

  "about_me_short": "I’m Jonas, a full-stack mobile software developer.",
  "about_me_text": "      I’m passionate about what I do, very curious and above all tenacious: I have never given up on solving a problem.\n\n      Outside of the office, you might find me baking bread in my kitchen or playing board games. I also love hearing about other people’s passion so if you want to share or hire me, do drop me a message!"
}
